doc/org-mode/about.org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css">
#+TITLE: Nitrogen 2.x Documentation
#+AUTHOR: Rusty Klophaus (@rklophaus)
#+EMAIL: 

#+TEXT: [[file:./index.org][Getting Started]] | [[file:./api.org][API]] | [[file:./elements.org][Elements]] | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | About
#+HTML: <div class=headline>About Nitrogen</div>

* Resources

  + NitrogenProject.com - http://nitrogenproject.com

  + Source Code - http://github.com/rklophaus/nitrogen

  + Donations - http://pledgie.com/campaigns/2057

  + Mailing List - http://groups.google.com/group/nitrogenweb
  
  + Bugs and Issues - http://nitrogen.lighthouseapp.com

* Versions

  Nitrogen relies on some or all of the following software:

  + *Erlang R13B03* or later - http://erlang.org

  + *SimpleBridge* - Common interface to Erlang HTTP servers.
    - Git Repo: git://github.com/rklophaus/SimpleBridge.git
    - Tag: v1.1.0

  + *mochiweb* - HTTP Server (Optional)
    - SVN Repo: http://mochiweb.googlecode.com/svn/trunk/
    - Tag: 1.5.0

  + *webmachine* - HTTP Server (Optional)
    - SVN Repo: https://github.com/basho/webmachine
    - Revision: webmachine-1.7.3

  + *yaws* - HTTP Server - http://yaws.hyber.org/ (Optional)
    - Source: http://yaws.hyber.org/download/yaws-1.89.tar.gz

  + *JQuery 1.4.2* - http://jquery.com

  + *JQuery UI 1.8rc2* - http://jqueryui.com

  + *Live Validation 1.3* - http://livevalidation.com/

* Thanks

  Sincere thanks to all the people who have helped make Nitrogen great, including:
   
  + Rusty Klophaus (@rklophaus)
  + Chris Williams (@voodootikigod)
  + Joel Reymont (@wagerlabs)
  + Tom McNulty
  + Martin Scholl (@zeit\_geist)
  + Dave Peticolas
  + Jon Gretar Borgthorsson (@jongretar)
  + Dan Bravender (@dbravender)
  + Taavi Talvik
  + Torbjorn Tornkvist (@kruskakli)
  + Marius A. Eriksen (@marius)
  + Michael Mullis
  + John Dragos
  + Benjamin Nortier (@bjnortier)
  + Jay Doane
  + Robert Schonberger
  + Yurii Rashkovskii (@yrashk)
  + Ville Koivula
   
  Roughly sorted by date of contribution. Send your twitter handles to @rklophaus

* Documentation

  This documentation is created using org-mode. To contribute updates
  or corrections, contact Rusty Klophaus (@rklophaus) or fork and
  update the code in http://github.com/rklophaus/nitrogen under the
  =./docs/org-mode= directory
